#================
#import部分
#================
import random #代码太丑了，有功夫改改

FORE_CHANGE=30.48
#def change_1(yingchi):
    #英尺到米
#    meter=yingchi*FORE_CHANGE*0.01
#    return meter  
#========================
#函数部分
#========================
def pr1():
    print(bcolor.FAIL+"==================================================================================================")
    print("                                 霓虹铸道根本宝藏")
    print("=================================================================================================="+bcolor.ENDC)
def pr2():
    print("==================================================================================================")

    print("                                     诸邪辟易")
    print("天道毕，三五成，日月俱，出窈窈，入冥冥，气布道，气通神。气行奸邪鬼贼皆消亡。视我者盲，听我者聋。敢有图谋我者反受其殃  -- 诸邪辟易")
    print("==================================================================================================")
def pr3():
    print("==================================================================================================")
    print("       三尺龙泉射斗牛，不平之事便分忧。磨开杀气千魔息，错出陈云百怪愁。 -- 《玄虚子鸣真集》")
    print("                                            请宝剑出鞘！")
    print("==================================================================================================")
#叛客异色观
#华山钢铠呼吸法
#机甲钢拳

def pexit():
    print("==================================================================================================")
    print("                                            功行圆满")
    print("==================================================================================================")


def pshort():
    print("=======")
def plong():
    print("==================================================================================================")


def one_click_divination():
    a=random.randint(1,8)#顺便，这东西绝对不需要沐浴更衣什么的就能达到心若冰清
    b=random.randint(1,8)#心持远胜人类啊桀桀桀桀桀桀桀
    if a==1:
        c="乾"
    elif a==2:
        c="坤"
    elif a==3:
        c="震"
    elif a==4:
        c="艮"
    elif a==5:
        c="离"
    elif a==6:
        c="坎"
    elif a==7:
        c="兑"
    elif a==8:
        c="巽"

    if b==1:
        d="乾"
    elif b==2:
        d="坤"
    elif b==3:
        d="震"
    elif b==4:
        d="艮"
    elif b==5:
        d="离"
    elif b==6:
        d="坎"
    elif b==7:
        d="兑"
    elif b==8:
        d="巽"

    print("上"+c+"下"+d+"卦")


#========================
#类部分
#========================

#==========
#此类用以改变文字输出颜色
#实现过程：
#终端的字符颜色是用转义序列控制的，是文本模式下的系统显示功能，和具体的语言无关。
#转义序列是以ESC开头,即用\033来完成（ESC的ASCII码用十进制表示是27，用八进制表示就是033）
#书写格式：
#开头部分：\033[显示方式;前景色;背景色m + 结尾部分：\033[0m
#
class bcolor(object):
    HEADER = '\033[95m'
    WARNING = '\033[93m'
    OKBLUE ='\033[94m'
    OKGREEN ='\033[92m'
    FAIL = '\033[91m'
    ENDC ='\033[0m'
    TEST = '\033[36m'

#========================
#程序主体部分
#========================
#while(True):
pr1()

#pr2()
#pr3()
while(True):
    print("2-六爻卜卦")
    print("3-单位换算")
    print("4-掷骰子")
    print("0-功行圆满")
    a=int(input("请选择要进行的操作"))

#if(a==1):

    if(a==2):
        one_click_divination()        
    if(a==3):
        print("1-英尺")
        print("2-英里")
        print("3-英寸")
        y=int(input("请选择数据的单位"))
        x=int(input("请输入一个数"))
        if(y==1):
            print("这个数换算后是【{}】英寸,【{}】英尺,【{}】英里,【{}】米".format(x*12,x,x*0.00018939393939394,x*FORE_CHANGE*0.01))
    if(a==4):
        while(True):
            print("请选择要掷的骰子面数")
            print("1-D10")
            print("2-D20")
            print("3-D100")
            print("4-自定义")
            print("47-退出")
            a=int(input())
            if(a==47):
                break
            elif(a==1):
                b=random.randint(0,10)
                print("=======")
                print("1D10={}".format(b))
                print("=======")

            elif(a==2):
                b=random.randint(0,20)
                pshort()
                print("1D20={}".format(b))
                pshort()
            elif(a==3):
                b=random.randint(0,100)
                pshort()
                print("1D100={}".format(b))
                pshort()



    if(a==0):
        pexit() 
        break



#1 foot 英尺(呎) = 0.00018939393939394miles(英里)=12 inches 英寸(吋) = 30.48 centimeters(厘米)=0.3048meters(米) = 0.333333333333333333yard(码) [2] 

